# 1、判定一个输入的整数是否为偶数
# num = int(input('输入一个整数:'))
# if num % 2 == 0:
#     print('为偶数')
# else:
#     print('不为偶数')


# 2、验证自己是否成年(18岁及以上属于成年)
# age = int(input('输入年龄:'))
# if age >= 18:
#       print('成年')
# else:
#       print('未成年')

# age = int(input('输入一个整数'))
# print('成年' if age >= 18 else '未成年')


# 3、闰年问题（输入一个年份，判断是否为闰年）
# # 能被4整除 不能被100整除
# # 或者能被400整除
# year = int(input('输入年份:'))
# if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#     print('闰年')
# else:
#     print('非闰年')


# 4、小明身高1.75，体重80kg。请根据BMI公式（体重除以身高的平方）帮小明计算他的BMI指数，并根据BMI指数：
# 1）低于18.5：过轻
# 2）18.5-25以下：正常
# 3）25-28以下：过重
# 4）28-32：肥胖
# 5）高于32：严重肥胖
# bmi = 80 / (1.75 ** 2)
# if bmi < 18.5:
#     print('过轻')
# elif 18.5 <= bmi < 25:
#     print('正常')
# elif 25 <= bmi < 28:
#     print('过重')
# elif 28 <= bmi <32:
#     print('肥胖')
# else:
#     print('严重肥胖')


# 5、购买车票，输入身高，判定1.2m以下输出购买儿童票；其他输出成人票
# height = int(input('输入身高(cm):'))
# if height < 120:
#     print('购买儿童票')
# else:
#     print('购买成人票')


# 6、输入温度，查看温度适宜问题（15度以下寒冷，15-29度舒适，30度及以上炎热)
# wen = float(input('输入温度:'))
# if wen < 15:
#     print('寒冷')
# elif 15 <= wen <= 29:
#     print('舒适')
# else:
#     print('炎热')


# 7、输入年龄，验证该年龄是否成年(18岁及以上属于成年)
# age = int(input('输入年龄:'))
# if age >= 18:
#     print('成年人')
# else:
#     print('未成年')


# 8、今天老板找我到办公室，说要调整薪资，输入老板说的薪资，输出我此刻的心情（条件和心情自由设定）
# salary = int(input('输入薪资:'))
# if salary >= 20000:
#     print('兴奋')
# elif 10000 < salary < 20000:
#     print('高兴')
# else:
#     print('沮丧')


# 9、输入一个成绩，如果考试成绩大于 90 分，则奖励一个 IPHONE 8S ，如果成绩介于 70 分至 90 分之间，则奖励一个小米，否则罚做 500 个俯卧撑。
# score = float(input('输入分数:'))
# if 90 < score:
#     print('奖励一部苹果8s')
# elif 70 < score <90:
#     print('奖励一部小米')
# else:
#     print('做500个俯卧撑')


# 10、在游乐场中，门票全票价位10美元
# 4岁以下免费；
# 4~18岁收费3美元；
# 18岁（含）以上收费10美元。
# 对于65岁（含）以上的老人，可以半价（即5美元）购买门票，输入年龄，查看需要多钱购买门票
# age = int(input('输入年龄:'))
# if age < 4:
#     print('免费')
# elif 4 <= age < 18:
#     print('3美元')
# elif 18 <= age <65:
#     print('10美元')
# else:
#     print('半票（5美元）')





# 请写1个ATM程序.定义1个变量,用来存储该ATM机器中剩余的金额.
# 1)接收用户输入取款金额.由于ATM机器只支持100的票子.
# 2)如果用户输入的取款金额不是100的倍数的话.则打印 "对不起,本机器无法提供输入的面额"
# 3)如果用户输入的取款金额大于了ATM的剩余金额.则打印 "对不起,余额不足."
# 4)如果用户输入的取款金额是100的倍数,并且小于等于ATM的剩余金额就打印."正在出钞,请从出钞口拿钱.ATM机器剩余xx元
# m = 1000000
#
# money = int(input('请输入金额(100的整数):'))
#
# if money > m:
#     print('对不起余额不足')
# elif money % 100 != 0:
#     print('对不起,本机器无法提供输入的面额')
# else:
#     money % 100 ==0 and money <= m
#     print('正在出钞,请从出钞口取走钞票.ATM机器剩余{}元'.format(m - money))
#
#
# exit()#  文件结束



# 1、打印输出100 - 200 以内所有能被3 和 4 整除的数
# i = 100
# while i < 200:
#     i += 1
#     if i % 3 == 0 and i % 4 == 0:
#         print(i)

# i = 100
# while i <= 200:
#     if i % 3 == 0 and i % 4 == 0:
#         print(i)
#     i = i + 1

# 2、打印个位数和十位数相同的二位数
# i = 10
# while 10 <= i < 100:
#     i = i + 1
#     if i % 10 == i // 10:
#         print(i)

# i = 10
# while i < 100:
#     if i % 10 == i // 10:
#         print(i)
#     i = i + 1


# 3、输出100以内能被8整除的数
# i = 0
# while i < 100:
#     i = i + 1
#     if i % 8 == 0:
#         print(i)


# 4、求 1-100以内所有含6的数
# i = 1
# while i <= 100:
#     i += 1
#     if i % 10 == 6 or i // 10 == 6:
#         print(i)




# 5、循环输入7天温度，求平均温度
# i = 0
# s = 0
# while i < 7:
#     i += 1
#     wen = float(input('输1入第{}天温度'.format(i)))
#     s = s + wen
# print('总温度{},平均温度{}'.format(s,s / 7))

#
# 提升：
# 1、输入班级学生语文成绩，求总成绩和平均成绩 。班级人数从键盘输入
# count = int(input('输入班级人数:'))
# i = 0
# s = 0
#
# while i < count:
#     i += 1
#     score = float(input('输入第{}个语文成绩'.format(i)))
#     s = s + score
# print('总成绩{},平均成绩{}'.format(s,s /  count))

# 2、从键盘输入10个数，求出最大数
# i = 0
# m = 0
# while i < 10:
#     i += 1
#     s = float(input('输入数字第{}个数'.format(i)))
#     if i == 1:
#         m = s
#     elif m < s:
#         m = s
#     print(m)

# 3、求 0 -1 + 2 - 3 + 4 - 5 + 6 -7.... + 100
# 偶数相加-奇数相加
# i = 0
# s1 = 0 #奇数和
# s2 = 0 #偶数和
# while i <= 100:
#     if i % 2 == 0:
#         s2 = s2 + i
#     else:
#         s1 = s1 + i
#     i = i + 1
# print(s2 - s1)

# 方法二 判定遇到奇数相减 偶数相加
# i = 0
# s = 0
# while i <= 100:
#     if i % 2 == 0:
#         s = s - i
#     i = i + 1
# print(s)

#三: 使用（-1） 的i次方
i = 0
s = 0
while i <= 100:
    s = s + (-1) ** i * i
    i = i + 1
print(s)

# 经典笔试题:
# 1、水仙花数：水仙花数是指一个 n 位数 ( n 大于等于 3 )，它的每个位上的数字的 n 次幂之和等于它本身。
# （例如：1的3次方 + 5的三次方 + 3三次方 = 153）。根据这个要求，打印所有三位数的水仙花数。